Show / Hide Table of Contents
Class Beam
Representation of 1D member in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Element1D
Beam
Implements
IGeometryPart
Inherited Members
 Element1D.Name
 Element1D.CrossSectionBegin
 Element1D.CrossSectionEnd
 Element1D.Segment
 Element1D.RotationRx
 Element1D.EccentricityBeginX
 Element1D.EccentricityBeginY
 Element1D.EccentricityBeginZ
 Element1D.EccentricityEndX
 Element1D.EccentricityEndY
 Element1D.EccentricityEndZ
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
public class Beam : Element1D, IGeometryPart
Constructors
Improve this Doc   View Source
Beam()
Constructor
Declaration
public Beam()
Properties
Improve this Doc   View Source
Edges
Lines of Element2D including edges, which are created by opening
Declaration
public List<ReferenceElement> Edges { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
GeomId
Id representing geometrical parts of Detail
Declaration
public int GeomId { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
InsertPoint
Insert point 0 - 9
Declaration
public int InsertPoint { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
MasterComponent
Master component
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterPoint
Master point 0 - 9
Declaration
public int MasterPoint { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Position
Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
Declaration
public Vector3D Position { get; set; }
Property Value
 Type |  Description
 Vector3D
Implements
 IGeometryPart
 Improve this Doc
 View Source